Autodesk.Revit.DB.Mechanical.MEPHiddenLineSettings.GetMEPHiddenLineSettings(Autodesk.Revit.DB.Document)
Gets the MEP hidden line settings in the document.
doc:
The document where the settings element is found.
Returns:
The element which stores the MEP hidden line settings for the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.Mechanical.MEPHiddenLineSettings.DrawHiddenLine
Indicates if duct or piping is drawn with the line style and gaps specified for hidden lines.
Since:
2022

Autodesk.Revit.DB.Mechanical.MEPHiddenLineSettings.LineStyle
The line style that determines how the lines of a hidden segment display at the point where the segments cross.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The line style is invalid for hidden line display.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.Mechanical.MEPHiddenLineSettings.SingleLineGap
The gap for the single hidden lines where segments cross.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The gap size must be between 0" and 3/4".
Since:
2022

Autodesk.Revit.DB.Mechanical.MEPHiddenLineSettings.OutsideGap
The gap for the lines that appear external to the crossing segments.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The gap size must be between 0" and 3/4".
Since:
2022

Autodesk.Revit.DB.Mechanical.MEPHiddenLineSettings.InsideGap
The gap for the lines that appear within a crossing segment.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The gap size must be between 0" and 3/4".
Since:
2022

Autodesk.Revit.DB.Mechanical.MEPHiddenLineSettings
Represents the settings contained in the document associated to the MEP hidden line display.
Since:
2022